{
    "details": [
        {
            "title": "Dr. Nandan Kundetkar",
            "desc": "Dr. Nandan Kundetkar is a visionary professional with a strong passion for technological development. With expertise in system design, integration, and programmatic derivation, he is a highly sought-after Design Consultant, Data and Network Security Expert, and Technology Entrepreneur. Nandan's groundbreaking contributions to medical diagnostics include his patented System & Methods for Diagnostic Analysis of Human Body Systems, Organs, and Cells, utilizing Cloud-Based Technology. He has developed the Femto Gold Quad Chip Device (FGQD) using NANO and FEMTO technology , which aims to bring about cellular-level changes to address various pathologies. Nandan's breakthrough has the potential to provide critical medical relief within four days, even for severely ill patients on ventilators. In addition to his achievements in medical diagnostics, Nandan holds multiple patents in IPTV, broadband media, and data security. He is highly respected for his exceptional research and extensive expertise in consumer electronic goods and cutting-edge technology advancements. Nandan's innovative mindset and comprehensive understanding of technology have established him as a leading expert in multiple niche technologies. His unwavering commitment to driving advancements in technology continues to make a significant impact on the industry."
        },
        {
            "title": "Mr. Kunal Sharma",
            "desc": "Mr. Kunal Sharma is a seasoned professional with over 7 years of experience in the IT, Information Security, and Media Broadcasting industry. His expertise lies in high-security IT requirements, serving banks, government establishments, and law enforcement agencies. Kunal's skills encompass complete IT setups, including network architecture, planning, management, security, and infrastructure audits. With a deep understanding of critical IT infrastructure, Kunal ensures the confidentiality, integrity, and availability of systems and data. He excels in designing and implementing secure network solutions that meet the highest standards. Kunal also brings valuable knowledge of DVB standards, enabling him to evaluate technologies and contribute to media broadcasting system design and implementation. Adaptable and dedicated, Kunal's proficiency spans network architecture, planning, management, security, infrastructure audits, and media broadcasting technology evaluations. His commitment to staying current with industry trends further enhances his capabilities as an IT and information security specialist. With a successful track record in demanding environments, Mr. Kunal Sharma offers a wealth of expertise. His skills, experience, and commitment make him a valuable asset in the IT and media broadcasting domains."
        },
        {
            "title": "Mr. Piyush Dikshit",
            "desc": "Mr. Piyush Dikshit is a highly accomplished techno-commercial professional with a bachelor's degree in Electronics and a master's degree in Business Management from IIM-Calcutta, one of India's top business schools. With extensive experience in the telecom, automotive, and defense industries, Piyush has become an expert in working with electronic components such as Connectors, Cables, and Harnesses. Piyush's remarkable achievements include establishing the market for \"Corning Gilbert Inc.\" products in India and expanding the business to the Asia Pacific region in less than a decade. His strategic thinking and business development skills have been instrumental in driving growth and success. As part of the Motherson Group, Piyush played a key role in growing market share in the automotive sector, identifying new business opportunities, and leading global sales and marketing efforts. His expertise has been valuable in expanding operations and building strong customer relationships. Currently, at the BSS Group, Piyush utilizes his sales and marketing experience, manufacturing expertise, and innovative approaches to add value to the company. He also mentors and guides young team members, fostering a culture of growth and innovation. Driven by his interest in the telecom industry, Piyush has ventured into entrepreneurship to address market gaps and provide innovative solutions. Mr. Piyush Dikshit's profile showcases his technical knowledge and business acumen. His proven track record, strategic vision, and commitment to excellence make him a highly respected professional in the industry, continuously driving growth and inspiring others."
        },
        {
            "title": "Mr. Arnav Chaudhary",
            "desc": "Mr. Arnav Chaudhary is a highly skilled professional with over 11 years of experience, including 8 years of post-qualification expertise. He has a proven track record of developing and executing projects across diverse domains, focusing on real-world challenges and delivering impactful solutions for the public. Arnav's portfolio includes innovative projects such as the Solar Car (Freyr1 SolarMobile), Defence Robot, Blind Aid, and Public Bike Sharing System (Planet green bikes). These projects have provided him with hands-on experience in developing complex electronic, electrical, and embedded systems, showcasing his ability to address practical problems. As an entrepreneur, Arnav founded a startup focused on secure communication and data encryption through blockchain technology. Despite its closure due to regulatory changes, this experience highlights his commitment to innovation and willingness to explore emerging technologies. Currently serving as the Chief Technical Officer, Arnav brings his extensive technical expertise, project management skills, and innovative mindset to the organization. His profound understanding of electronics, electrical systems, and embedded technologies allows him to contribute to cutting-edge solutions that drive progress and improve lives. Arnav's career is a testament to his determination to make a positive impact through technology-driven initiatives. As the Chief Technical Officer, he plays a crucial role in leading technical teams, driving innovation, and implementing cutting-edge solutions. With his expertise and track record of success, Arnav is an invaluable asset in shaping the organization's technological landscape and ensuring continued growth and success."
        },
        {
            "title": "Mr. Vikki Choudhry",
            "desc": "Mr. Vikki Choudhry is a seasoned professional with over 25 years of experience in the Entertainment, Broadcast Media, Technology, and Defence industries. As a Chief Evangelist, he is renowned for his expertise as an Analyst, Visionary Entrepreneur, and Investor. Throughout his career, Mr. Choudhry has played a pivotal role in the Digital Cable and Broadband industry, gaining hands-on experience in cable, broadcast, and broadband services. He was instrumental in establishing the first MSO JV in 1994 between Falcon Cable TV (USA) and Hindustan Times, a leading newspaper publication house in India. This opportunity allowed him to familiarize himself with the operations of prominent MSOs such as CableVision, Comcast, and Falcon in the USA. As a life member of esteemed organizations including BES (Broadcast Engineering Society), SCTE (Society of Cable Telecommunications Engineers) India, and active memberships in DDCA (Delhi District Cricket Association) and INSIST (Indian School of Innovation in Sustainability), Mr. Choudhry has been closely associated with TV broadcasting and internet delivery since their inception in the country. His extensive experience has contributed to the evolution of regulatory policies in the cable and broadcasting services sector. He has represented the challenges faced by the broadcasting industry before regulatory departments and ministries in the Indian Government, advocating for its betterment. Mr. Choudhry's entrepreneurial spirit led him to launch pioneering initiatives such as the first Free to Air digital broadcast channel MCM (Music) in 1997, followed by Fashion TV (FTV) in 1998, and the first HD (High definition) LUXE TV. He played a key role in channel distribution, regulatory affairs, content production, promotions, business development events, and marketing of TV channel-associated products and services. Having spearheaded multi-service operations, telecommunication and distribution platforms, as well as associations in the aerospace, defence, and technology sectors, Mr. Choudhry has been instrumental in bringing international media, telecommunications, arms manufacturing, and defense companies to India for representation and offset operations. Mr. Vikki Choudhry's illustrious career and extensive contributions in the entertainment, broadcast media, technology, and defence sectors highlight his visionary leadership and entrepreneurial spirit. His expertise, industry knowledge, and commitment to excellence continue to shape and transform these industries in India."
        },
        {
            "title": "Mr. Yash Jindal",
            "desc": "span various crucial aspects, including designing tax-effective structures, drafting legal documents, managing compliance, liaising with regulatory authorities, handling cross-border taxation, treasury management, and accounting. Having worked with reputable firms such as BMR & Associates LLP (Taxand India) and Deloitte Haskins and Sells LLP, Yash served a diverse clientele, including Fortune 500 companies across different regions like Japan, the United States, Europe, Singapore, and Australia. His meticulous attention to detail and profound understanding of financial, legal, and regulatory landscapes allowed him to guide clients towards achieving their business goals. Motivated by his passion for the telecommunication, aerospace, and defense industry, Yash embarked on an entrepreneurial journey. He focuses on promoting and indigenizing innovative technologies, primarily from Russia, Central European countries, and other Commonwealth of Independent States (CIS) countries. Leveraging his expertise and industry knowledge, Yash aims to introduce cutting-edge technologies while fostering localized development and integration. Yash's entrepreneurial spirit and multidisciplinary expertise make him a valuable asset in finance, law, and regulation. His ability to navigate complex environments, identify innovative solutions, and drive business growth has earned him a reputation as a trusted advisor and a catalyst for change. Through his entrepreneurial endeavors, Yash strives to make a lasting impact by facilitating technology transfer, nurturing strategic partnerships, and contributing to the growth of the telecommunication, aerospace, and defence sectors. His vision and dedication exemplify the qualities of a true entrepreneur committed to creating positive change and driving innovation within the industry."
        },
        {
            "title": "Lt. Gen CA Krishnan",
            "desc": "Lieutenant General CA Krishnan, PVSM, UYSM, AVSM, is a former Deputy Chief of the Army and a former Member of the Armed Forces Tribunal. A postgraduate in Defence studies and M Phil in strategic affairs and Defence Management, he is also a post graduate diploma in Human Rights Laws from NLSIU, Bangalore and a post graduate diploma in journalism. He has four decades of operational experience across high altitude remote areas of Ladakh, Arunachal Pradesh and Siachen Glacier as well as vast experience in combating terrorism in Jammu & Kashmir and Northeast. He oversaw the Army’s macro level Human Resource management as the Director General of Manpower Planning & personnel services. Subsequently, as the Deputy Chief, he was responsible for perspective planning, Capital acquisition programs and financial planning of the Indian army. Widely travelled and has been part of numerous delegations representing the country. He has been on the Board of Directors of Bharat Electronics Ltd and Bharat Dynamics Ltd, two of India’s leading Defence Public sector undertakings and provides consultancy to defence industries. He is a regular speaker on geopolitics and national security and also a prolific writer on a wide variety of subjects."
        },
        {
            "title": "AVM Pradeep Ranjan Sinha, VSM (R)",
            "desc": "With over 40 years of distinguished service, the Air Vice Marshal is a veteran of the Indian Air Force, bringing extensive experience across diverse roles. Notably, he has made significant contributions in the field of Air Traffic Services, excelling in instructional, regulatory oversight, and policy-making capacities within the IAF. Throughout his career, he has demonstrated exceptional proficiency in procedural and radar controlling, garnering wide-ranging field experience. As the Director of Air Traffic Services, he spearheaded the ATS organization of the IAF, overseeing its efficient operations. Moreover, he led the MAFI project, which involved the operationalization of various Radio Navigation aids in the IAF. His expertise extends beyond the military realm, as he has also served as a consultant for the Directorate General of Civil Aviation (DGCA), focusing on the integration of civil-military aviation. During his tenure, he successfully synergized civil-military coordination procedures, receiving praise from ICAO Audit Team experts. In his role as Chief Mentor at an Aviation Academy, he played a pivotal role in coordinating medicals and ground subjects for aspiring candidates. Additionally, he actively participated in teaching sessions, ensuring exceptional outputs and harmonizing flying training across various flying academies. The Air Vice Marshal's profile exemplifies his unparalleled expertise in air traffic management, instructional leadership, and regulatory oversight. His commendable service, accolades, and notable contributions to civil-military aviation integration and pilot training underscore his invaluable contributions to the aviation industry."
        },
        {
            "title": "Wing Commander Deepak Bhan",
            "desc": "Deepak Bhan is a dynamic professional with a remarkable 34 years of experience in Engineering design, Operations Management, Delivery Management, Quality, and Team Management. He spent 21 years of his career serving in the Indian Air Force, attaining the rank of Wing Commander before opting for premature retirement. Currently, he holds the position of Executive Director at Limco Global Services Private Limited. Deepak's expertise lies in handling the overall functioning and engineering of processes, as well as implementing projects related to the Indian Air Force, Army, Navy, and their associated Public Sector Undertakings (PSUs). His extensive experience in the defence sector has provided him with a deep understanding of the unique challenges and requirements of these organizations. With a proven track record of leadership and management, Deepak excels in ensuring the successful execution of projects while maintaining high-quality standards. His strategic vision, combined with his technical acumen, enables him to drive operational excellence and achieve organizational goals. Deepak Bhan's profile showcases his comprehensive knowledge and expertise in the defense and engineering sectors. His ability to navigate complex environments, lead multidisciplinary teams, and deliver exceptional results makes him a valuable asset in managing and executing projects for defense organizations and related PSUs in India."
        },
        {
            "title": "Ashok Kumar Saxena ",
            "desc": "Ashok Kumar Saxena is a highly accomplished professional with a diverse background and a track record of success in various industries. Currently serving as the Chairman of the Advisory Board at d3i Systems, he brings a wealth of experience and strategic insights to the organization. Notably, as the Executive VP of SciSpace, a subsidiary of d3i Systems, he managed a team of scientific researchers utilizing supercomputers for climate analysis and prediction. His leadership contributed to the company's advancements in this field. Ashok Kumar Saxena is also recognized as a Co-Founder of One97 Communications Limited, a prominent company providing mobile communications and financial transaction services in India under the name Paytm. His vision, initial funding, and business acumen played a pivotal role in the company's success, leading to its remarkable $2.5 billion IPO, the largest in India. Throughout his career, he has held key leadership positions in notable organizations. As the President of INNOVIM Defense Services (IDS), he oversaw the start-up of all business operations and successfully secured prime contracts and subcontracts. Similarly, as the Chief Operating Officer of INNOVIM, he implemented senior management changes to drive business growth and secured major contracts at NOAA. His extensive experience also includes roles as Vice President of Programs at ECSI International, where he managed the design and deployment of anti-terrorism systems, and as a Business Capture and Program Management Consultant at L-3 Communications, leading critical technical efforts and capture initiatives. Earlier in his career, Ashok founded and served as the President of companies such as SignmaNet Network Corporation and INFORMATICS Inc., where he won and executed contracts for prestigious clients in the aerospace, defense, and commercial sectors. With a proven track record of successful business ventures, strategic leadership, and a wide range of expertise, Ashok Kumar Saxena continues to make significant contributions to the industries he operates in."
        }
    ]
}
